ErpTest/src/Catalogs/уатПунктыНазначения/уатПунктыНазначения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>уатПунктыНазначения</name>
  <comment>(уат)</comment>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>Адрес</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоступностиПо</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВремяДоступностиС</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЗначенияПолейАдреса</name>
    <type>
      <types>ValueStorage</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <comment>Комиссия (УАТ_Пассажирские перевозки)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <comment>Контрагент (УАТ_Пассажирские перевозки)</comment>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Лат</name>
    <comment>Широта пункта назначения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лон</name>
    <comment>Долгота пункта назначения</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>21</precision>
        <scale>17</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Регион</name>
    <comment>Регион (уэ)</comment>
    <type>
      <types>CatalogRef.УдалитьУатРегионы</types>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьСтоянка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Страна</name>
    <comment>Страна (уэ)</comment>
    <type>
      <types>CatalogRef.СтраныМира</types>
    </type>
  </attributes>
  <attributes>
    <name>ТелефонныйКод</name>
    <comment>Телефонный код (уэ)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УдалитьТипПункта</name>
    <type>
      <types>EnumRef.УдалитьУатТипыПунктовНазначения</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипПункта</name>
    <type>
      <types>CatalogRef.уатТипыПунктов</types>
    </type>
  </attributes>
  <attributes>
    <name>Гараж</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Автостанция</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>УдалитьРазрешенныеТипыТС</name>
    <attributes>
      <name>ТипТС</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Стоянка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>6</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

ErpTest/src/InformationRegisters/уатРасстоянияМеждуПунктами/уатРасстоянияМеждуПунктами.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>уатРасстоянияМеждуПунктами</name>
  <comment>(уат)</comment>
  <resources>
    <name>Расстояние</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>7</precision>
        <scale>1</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Время</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>6</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Пункт1</name>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пункт2</name>
    <type>
      <types>CatalogRef.уатПунктыНазначения</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

ErpTest/src/Catalogs/уатПунктыНазначения/Forms/ФормаЭлемента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	об = РеквизитФормыВЗначение("Объект");
	//уатЗащищенныеФункцииСервер.уатСправочникФормаЭлементаПриСозданииНаСервере(Об, Отказ, СтандартнаяОбработка, ЭтаФорма, ДопПараметрыОткрытие);
	ЗначениеВРеквизитФормы(Об,"Объект");
	Если Отказ тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	ДополнительныеПараметры = Новый Структура;
	ДополнительныеПараметры.Вставить("ИмяЭлементаДляРазмещения", "ГруппаДополнительныеРеквизиты");
	УправлениеСвойствами.ПриСозданииНаСервере(ЭтотОбъект, ДополнительныеПараметры);
	// Конец СтандартныеПодсистемы.Свойства
	
	Если НЕ Объект.Ссылка.Пустая() Тогда
		ЗначенияПолейКИ_ = ПолучитьЗначенияПолейКИ(Объект.Ссылка);
		Если ТипЗнч(ЗначенияПолейКИ_) = Тип("Строка") Тогда
			ЗначенияПолей = ЗначенияПолейКИ_;
		КонецЕсли;
	КонецЕсли;
	
	// УправлениеПредприятием.СлужебныеПодсистемы
	СобытияФорм.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка);
	// Конец УправлениеПредприятием.СлужебныеПодсистемы
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	//уатЗащищенныеФункцииКлиент.уатСправочникФормаЭлементаПриОткрытии(Отказ, ДопПараметрыОткрытие);
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ОбновитьРасстояния();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаЗаписиНового(НовыйОбъект, Источник, СтандартнаяОбработка)
	ОбновитьРасстояния();
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПередЗаписьюНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
	ТекущийОбъект.ЗначенияПолейАдреса = Новый ХранилищеЗначения(ЗначенияПолей);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	// СтандартныеПодсистемы.Свойства 
	Если УправлениеСвойствамиКлиент.ОбрабатыватьОповещения(ЭтотОбъект, ИмяСобытия, Параметр) Тогда
		ОбновитьЭлементыДополнительныхРеквизитов();
		УправлениеСвойствамиКлиент.ПослеЗагрузкиДополнительныхРеквизитов(ЭтотОбъект);
	КонецЕсли;
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	
	// СтандартныеПодсистемы.Свойства
	УправлениеСвойствами.ОбработкаПроверкиЗаполнения(ЭтотОбъект, Отказ, ПроверяемыеРеквизиты);
	// Конец СтандартныеПодсистемы.Свойства
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура АдресОткрытие(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	ОткрытьФорму("Справочник.уатПунктыНазначения.Форма.ФормаВводаАдреса",,Элемент);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	  
	уатОбщегоНазначенияТиповыеКлиент.ПредставлениеНачалоВыбораПунктаНазначения(ЭтотОбъект, Элемент, , СтандартнаяОбработка);
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	Если ТипЗнч(ВыбранноеЗначение) = Тип("Структура") Тогда
		СтандартнаяОбработка = Ложь;                          
		Если ВыбранноеЗначение.Свойство("Город") И ВыбранноеЗначение.Свойство("Улица") 
			И ВыбранноеЗначение.Свойство("Дом") И ВыбранноеЗначение.Свойство("Корпус") Тогда 
			
			Адрес = "";
			
			Если ЗначениеЗаполнено(ВыбранноеЗначение.Город) Тогда
				Адрес = Адрес + ВыбранноеЗначение.Город + ", ";
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыбранноеЗначение.Улица) Тогда
				Адрес = Адрес + ВыбранноеЗначение.Улица + ", ";
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыбранноеЗначение.дом) Тогда
				Адрес = Адрес + ВыбранноеЗначение.дом + ", ";
			КонецЕсли;
			Если ЗначениеЗаполнено(ВыбранноеЗначение.Корпус) Тогда
				Адрес = Адрес + "корп. " + ВыбранноеЗначение.Корпус + ", ";
			КонецЕсли;
			Если ЗначениеЗаполнено(Адрес) Тогда
				Адрес = Лев(Адрес, СтрДлина(Адрес) - 2);
			КонецЕсли;
			
			Объект.Адрес = Адрес;
				
			
		ИначеЕсли ВыбранноеЗначение.Свойство("Лат") И ВыбранноеЗначение.Свойство("Лон") Тогда
			
			Объект.Лат = ВыбранноеЗначение.Лат;
			Объект.Лон = ВыбранноеЗначение.Лон;
			
			Если ЗначениеЗаполнено(ВыбранноеЗначение.Адрес) тогда
				Ответ = КодВозвратаДиалога.Нет;
				Если ЗначениеЗаполнено(Объект.Адрес) тогда
					ПоказатьВопрос(Новый ОписаниеОповещения("АдресОбработкаВыбораЗавершение", ЭтотОбъект, Новый Структура("ВыбранноеЗначение", ВыбранноеЗначение)), "Поле адрес не пусто. Установить адрес выбранной точки?",
						РежимДиалогаВопрос.ДаНет,60,КодВозвратаДиалога.Нет);
                    Возврат;
				Иначе
					Ответ = КодВозвратаДиалога.Да;
				КонецЕсли;
				АдресОбработкаВыбораФрагмент(ВыбранноеЗначение, Ответ);

			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура АдресОбработкаВыбораЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    ВыбранноеЗначение = ДополнительныеПараметры.ВыбранноеЗначение;
    
    
    Ответ = РезультатВопроса;
    
    АдресОбработкаВыбораФрагмент(ВыбранноеЗначение, Ответ);

КонецПроцедуры

&НаКлиенте
Процедура АдресОбработкаВыбораФрагмент(Знач ВыбранноеЗначение, Знач Ответ)
    
    Если Ответ = КодВозвратаДиалога.Да тогда
        Объект.Адрес = ВыбранноеЗначение.Адрес;
    КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормы_РасстоянияМеждуПунктамиТаблицаРасстояний

&НаКлиенте
Процедура РасстоянияМеждуПунктамиТаблицаРасстоянийПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа)
	
	уатОбщегоНазначенияКлиент.ПроверитьЗаписьНовогоОбъектаВФорме(ЭтаФорма, Объект.Ссылка,,, Отказ);
	Если Отказ Тогда
		Возврат;
	КонецЕсли; 

	Отказ = Истина;
	
	Если Копирование Тогда
		Возврат;
	КонецЕсли;
	
	РедактироватьЗапись(Неопределено, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасстоянияМеждуПунктамиТаблицаРасстоянийПередНачаломИзменения(Элемент, Отказ)
	
	Отказ = Истина;
	
	РедактироватьЗапись(Элемент.ТекущиеДанные.Пункт, Объект.Ссылка);
	
КонецПроцедуры

&НаКлиенте
Процедура РасстоянияМеждуПунктамиТаблицаРасстоянийПередУдалением(Элемент, Отказ)
	
	Отказ = Истина;
	
	Если НужноУдалитьЗапись(Элемент.ТекущиеДанные.Пункт, Объект.Ссылка) Тогда 
		ОтветНаВопрос = Неопределено;
 
		ПоказатьВопрос(Новый ОписаниеОповещения("РасстоянияМеждуПунктамиТаблицаРасстоянийПередУдалениемЗавершение", ЭтотОбъект, Новый Структура("Элемент", Элемент)), "Удалить запись?", РежимДиалогаВопрос.ДаНет);
        Возврат;
	КонецЕсли;
	
	РасстоянияМеждуПунктамиТаблицаРасстоянийПередУдалениемФрагмент();
КонецПроцедуры

&НаКлиенте
Процедура РасстоянияМеждуПунктамиТаблицаРасстоянийПередУдалениемЗавершение(РезультатВопроса, ДополнительныеПараметры) Экспорт
    
    Элемент = ДополнительныеПараметры.Элемент;
    
    
    ОтветНаВопрос = РезультатВопроса;
    Если ОтветНаВопрос  = КодВозвратаДиалога.Да Тогда
        УдалитьЗаписьТаблицаРасстояний(Элемент.ТекущиеДанные.Пункт, Объект.Ссылка);
    КонецЕсли;
    
    РасстоянияМеждуПунктамиТаблицаРасстоянийПередУдалениемФрагмент();

КонецПроцедуры

&НаКлиенте
Процедура РасстоянияМеждуПунктамиТаблицаРасстоянийПередУдалениемФрагмент()
    
    ОбновитьРасстояния();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

// СтандартныеПодсистемы.Свойства
&НаКлиенте
Процедура Подключаемый_СвойстваВыполнитьКоманду(ЭлементИлиКоманда, НавигационнаяСсылка = Неопределено, СтандартнаяОбработка = Неопределено)
	УправлениеСвойствамиКлиент.ВыполнитьКоманду(ЭтотОбъект, ЭлементИлиКоманда, СтандартнаяОбработка);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// УправлениеПредприятием.СлужебныеПодсистемы
&НаКлиенте
Процедура Подключаемый_ВыполнитьПереопределяемуюКоманду(Команда)
	СобытияФормКлиент.ВыполнитьПереопределяемуюКоманду(ЭтаФорма, Команда);
КонецПроцедуры
// Конец УправлениеПредприятием.СлужебныеПодсистемы

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// СтандартныеПодсистемы.Свойства 
&НаСервере
Процедура ОбновитьЭлементыДополнительныхРеквизитов()
	УправлениеСвойствами.ОбновитьЭлементыДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьЗависимостиДополнительныхРеквизитов()
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПриИзмененииДополнительногоРеквизита(Элемент)
	УправлениеСвойствамиКлиент.ОбновитьЗависимостиДополнительныхРеквизитов(ЭтотОбъект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.Свойства

// Процедура обновляет информацию в таблице расстояний.
//
&НаСервере
Процедура ОбновитьРасстояния()
	
	ОбработкаОбъект = ДанныеФормыВЗначение(РасстоянияМеждуПунктами, Тип("ОбработкаОбъект.уатРасстоянияМеждуПунктами"));
	ОбработкаОбъект.Пункт = Объект.Ссылка;
	ОбработкаОбъект.ОбновитьТаблицу();
	ЗначениеВДанныеФормы(ОбработкаОбъект, РасстоянияМеждуПунктами);
	
КонецПроцедуры

// Процедура обрабатывает действие начала редактирования или ввода новой
// записи контактной информации
//
// Параметры
//  ВыбОбъект - объект уже существующей записи в регистре контактной информации
//  ВыбТип - тип уже существующей или новой записи в регистре контактной информации
//  ВыбВид - вид уже существующей или новой записи в регистре контактной информации
//  ТекущийОбъект - Объект новой записи в регистре контактной информации
//  ФормаВладелец - форма из которой произошел вызов процедуры
&НаКлиенте
Процедура РедактироватьЗапись(Пункт, ТекущийОбъект)
	
	КлючЗаписиРасстоянияМеждуПунктами = ПолучитьКлючЗаписи(Пункт, ТекущийОбъект);
	Если КлючЗаписиРасстоянияМеждуПунктами = Неопределено Тогда
		ПараметрыОткрытия = Новый Структура("Пункт1", ТекущийОбъект);
	Иначе
		ПараметрыОткрытия = Новый Структура("Ключ", КлючЗаписиРасстоянияМеждуПунктами);
	КонецЕсли;
	
	ОткрытьФорму("РегистрСведений.уатРасстоянияМеждуПунктами.ФормаЗаписи", ПараметрыОткрытия,,,,,
		Новый ОписаниеОповещения("РедактироватьЗаписьЗавершение", ЭтотОбъект), РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьЗаписьЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	ОбновитьРасстояния();

КонецПроцедуры

&НаСервере
Функция ПолучитьКлючЗаписи(Пункт, ТекущийОбъект)
	МенеджерЗаписи = РегистрыСведений.уатРасстоянияМеждуПунктами.СоздатьМенеджерЗаписи();

	Если ЗначениеЗаполнено(Пункт) Тогда
		МенеджерЗаписи.Пункт1 = Пункт;
		МенеджерЗаписи.Пункт2 = ТекущийОбъект;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			Возврат РегистрыСведений.уатРасстоянияМеждуПунктами.СоздатьКлючЗаписи(Новый Структура("Пункт1, Пункт2",	МенеджерЗаписи.Пункт1, МенеджерЗаписи.Пункт2));
		Иначе
			МенеджерЗаписи.Пункт1 = ТекущийОбъект;
			МенеджерЗаписи.Пункт2 = Пункт;
			МенеджерЗаписи.Прочитать();
			Если МенеджерЗаписи.Выбран() Тогда
				Возврат РегистрыСведений.уатРасстоянияМеждуПунктами.СоздатьКлючЗаписи(Новый Структура("Пункт1, Пункт2", МенеджерЗаписи.Пункт1, МенеджерЗаписи.Пункт2));
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Неопределено;
КонецФункции

&НаСервере
Функция НужноУдалитьЗапись(Пункт, ТекущийОбъект)
	
	Результат = Ложь;
	
	МенеджерЗаписи = РегистрыСведений.уатРасстоянияМеждуПунктами.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Пункт1 = Пункт;
	МенеджерЗаписи.Пункт2 = ТекущийОбъект;
	МенеджерЗаписи.Прочитать();
	
	Если МенеджерЗаписи.Выбран() Тогда
		Результат = Истина;
	Иначе
		МенеджерЗаписи.Пункт2 = Пункт;
		МенеджерЗаписи.Пункт1 = ТекущийОбъект;
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда
			Результат = Истина;
		КонецЕсли;
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции // НужноУдалитьЗапись()

&НаСервере
Процедура УдалитьЗаписьТаблицаРасстояний(Пункт, ТекущийОбъект)
	
	ОбработкаОбъект = РеквизитФормыВЗначение("РасстоянияМеждуПунктами");
	ОбработкаОбъект.УдалитьЗапись(Пункт, ТекущийОбъект);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПолучитьЗначенияПолейКИ(ТекСсылка)
	Возврат ТекСсылка.ЗначенияполейАдреса.Получить();
КонецФункции

#КонецОбласти
